In [2]:
server = Data()
server.first_load()

In [17]:
from azure.cosmos import CosmosClient
import json
from Utils.data import Data
from Utils.request import Request
import pandas as pd

In [4]:
request = Request()

In [5]:
data = request.big_data

In [6]:
data

,price,restaurant_id,orderable_id,orderable_name,order_id,amount_of_item,order_item_id,creation_date_order,customer_id,opening_hours,...,restaurant_name,real_price,day_of_week,day_name,day_of_month,day_of_year,month,month_name,year,week
0,17.122222,244,1613,Peach tart,145486,3,395579,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,51.366667,2,Wednesday,19,353,12,December,2018,51
1,24.600000,244,1611,San Pellegrino Sparkling Water,145486,2,395576,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,49.200000,2,Wednesday,19,353,12,December,2018,51
2,22.500000,244,1606,Cinnamon Raisin Danish ...1.60,145486,1,395577,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,22.500000,2,Wednesday,19,353,12,December,2018,51
3,26.300000,244,1612,Steak Tartare - with quail egg,145486,2,395578,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,52.600000,2,Wednesday,19,353,12,December,2018,51
4,17.122222,244,1613,Peach tart,95543,3,259604,2018-06-30 15:09:00,6359,13:00-23:00,...,S.S. Constitution,51.366667,5,Saturday,30,181,6,June,2018,26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
486026,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,141930,1,385873,2018-12-07 21:53:00,7963,13:00-23:00,...,Harvard University,22.200000,4,Friday,7,341,12,December,2018,49
486027,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,60294,1,164039,2018-02-18 18:00:00,5235,13:00-23:00,...,Harvard University,22.200000,6,Sunday,18,49,2,February,2018,7
486028,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,36661,1,100134,2017-11-18 15:01:00,9291,13:00-23:00,...,Harvard University,22.200000,5,Saturday,18,322,11,November,2017,46
486029,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,137324,1,373340,2018-11-23 15:11:00,24557,13:00-23:00,...,Harvard University,22.200000,4,Friday,23,327,11,November,2018,47
486030,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,71570,1,194633,2018-04-02 20:17:00,17064,13:00-23:00,...,Harvard University,22.200000,0,Monday,2,92,4,April,2018,14

In [ ]:
data.drop(data.loc[(data["city"] == "unknown")].index,inplace=True)

In [ ]:
data[['city']].value_counts()

In [ ]:
len(data['restaurant_name'].unique())

In [ ]:
df = request.revenue_cities()

In [ ]:
df['real_price'][0]

In [ ]:
df_dishes = request.least_expensive_dishes()
df_dishes

In [ ]:
request.revenue_city_year('New York ', 2019)

In [ ]:
request.revenue_restaurants()

In [ ]:
request.revenue_street_year()

In [ ]:
df_cr = data.groupby(['city', 'restaurant_name'], as_index=False)['real_price'].sum()

In [ ]:
df_cr['city'].value_counts()

In [ ]:
df = request.restaurant_revenue_per_city()
df

In [ ]:
df2 = df.

In [ ]:
df2.value_counts()

In [ ]:
df.plot(x='col_name_1', y='col_name_2')

In [ ]:
df = request.revenue_restaurant_year_by_month('(Fifth Avenue Hotel?}', 2017)

df['revenue ($)']

In [ ]:
request.revenue_restaurant_year_by_month('Agora',2018)

In [ ]:
df.plot(x='Month', y='revenue ($)')

In [ ]:
request.revenue_streets()

In [9]:
request.revenue_city_year(2018,'New York')

2601329.48471276

In [10]:
request.revenue_streets()

              street  real_price
131        E 52nd St    233528.7
360       W 163rd St    202708.5
124        E 17th St    189369.4
7             3rd Pl    177147.2
385       W Broadway    165769.7
..               ...         ...
167       Freeman Ct       891.7
277    Peninsula Ave       888.5
208          Juri St       883.4
237       Marengo St       691.8
22   Atalaya Terrace        84.8

[394 rows x 2 columns]

In [11]:
request.revenue_total_restaurants_mean()

55675.65852244825

In [14]:
df = request.least_expensive_dishes()
df

        order_id  real_price
72996      72996         8.2
32602      32602         8.2
147489    147489         8.2
23112      23112         8.2
106566    106566         8.2
...          ...         ...
156614    156614       407.4
175890    175890       408.0
154086    154086       417.9
153934    153934       429.4
163566    163566       438.3

[178724 rows x 2 columns]

In [16]:
df['real_price'].head(10)

72996     8.2
32602     8.2
147489    8.2
23112     8.2
106566    8.2
92235     8.2
72465     8.2
46855     8.2
31831     8.2
70634     8.2
Name: real_price, dtype: float64

In [21]:
chart_data = pd.DataFrame(
        df,
     columns=['order_id', 'real_price'])

In [22]:
chart_data

        order_id  real_price
72996      72996         8.2
32602      32602         8.2
147489    147489         8.2
23112      23112         8.2
106566    106566         8.2
...          ...         ...
156614    156614       407.4
175890    175890       408.0
154086    154086       417.9
153934    153934       429.4
163566    163566       438.3

[178724 rows x 2 columns]

In [23]:
request.the_most_expensive_order()

163566

In [26]:
request.revenue_streets_year(2017)

                    street  real_price
91               E 17th St     70662.1
95               E 52nd St     69628.1
268             W 163rd St     68697.0
287             W Broadway     68050.7
5                   3rd Pl     66601.2
..                     ...         ...
101              E 88th St       707.9
265             W 154th St       418.3
36               Bertha Ln       353.6
214  Queens Midtown Tunnel       183.0
112               Emery Ln        31.7

[294 rows x 2 columns]

In [34]:
request.restaurant['name'].head(10).sort

0                               Rods 1890s Ranch House
1                                     Southern Railway
2        Associates Of The Enginer Corps And Company K
3                                The Cleveland Bankers
4                                      The Streamliner
5                                        Lucullus Club
6                                              Club 31
7                    Toyo Kisen Kaisha  Hong Kong Maru
8    Veteran Corps Of Artillery Military Society Of...
9                                          C.F. Wetzel
Name: name, dtype: object

In [33]:
dr = request.restaurant['name'].head(10).to_list()

dr

['Rods 1890s Ranch House',
 'Southern Railway',
 'Associates Of The Enginer Corps And Company K',
 'The Cleveland Bankers',
 'The Streamliner',
 'Lucullus Club',
 'Club 31',
 'Toyo Kisen Kaisha  Hong Kong Maru',
 'Veteran Corps Of Artillery Military Society Of The War Of 1812',
 'C.F. Wetzel']